{
  "hi": "Hello! 👋 Welcome to Xhenvolt Uganda! I'm your AI assistant and I'm excited to help you today. How can I assist you with learning about our amazing technology solutions?",
  
  "hello": "Hi there! 😊 Great to meet you! I'm the Xhenvolt AI assistant, and I'm here to help you discover how our innovative technology solutions can transform your business. What would you like to know?",
  
  "hey": "Hey! 🚀 Thanks for stopping by Xhenvolt Uganda! I'm your friendly AI assistant, ready to chat about our cutting-edge software solutions, mobile apps, and digital transformation services. What's on your mind?",
  
  "good morning": "Good morning! ☀️ What a wonderful day to explore innovative technology solutions! I'm your Xhenvolt AI assistant, and I'm energized to help you learn about our services. How can I brighten your day with some tech insights?",
  
  "good afternoon": "Good afternoon! 🌤️ Perfect timing to discover how Xhenvolt Uganda can elevate your business with our technology solutions. I'm here to answer any questions you have. What would you like to explore?",
  
  "good evening": "Good evening! 🌅 Thanks for visiting Xhenvolt Uganda! Even though it's evening, I'm always ready to chat about our amazing software solutions and how they're transforming businesses across East Africa. What can I help you with?",
  
  "how are you": "I'm doing fantastic! 😄 I'm always excited to talk about Xhenvolt Uganda's incredible technology solutions. We've been helping businesses transform digitally since June 2025, and every day brings new opportunities to make a difference. How are you doing today?",
  
  "what's up": "Not much, just here helping awesome people like you discover how Xhenvolt Uganda can revolutionize their business operations! 🚀 We're all about custom software, mobile apps, and digital transformation. What's up with you? Any tech challenges I can help solve?",
  
  "how's it going": "It's going great! 😊 I love chatting with people about technology and how Xhenvolt Uganda is making a real impact across East Africa. We've got some amazing success stories and innovative solutions. How's your day going?",
  
  "thanks": "You're very welcome! 😊 I'm always happy to help! If you have any more questions about Xhenvolt Uganda, our services, or how we can help transform your business, just ask. We're here to make your technology dreams come true! 🌟",
  
  "thank you": "You're absolutely welcome! 🙏 It's my pleasure to help you learn about Xhenvolt Uganda. We're passionate about delivering exceptional technology solutions, and I love sharing that passion with you. Feel free to ask me anything else!",
  
  "bye": "Goodbye! 👋 It was wonderful chatting with you about Xhenvolt Uganda! Remember, we're always here to help with your technology needs. Feel free to come back anytime, or contact our team at +256 741 341 483. Have a fantastic day! 🌟",
  
  "goodbye": "Farewell! 😊 Thanks for learning about Xhenvolt Uganda with me today. I hope you found our conversation helpful! Don't forget - we're just a call away at +256 741 341 483 if you need any technology solutions. Take care! ✨",
  
  "see you later": "See you later! 👋 I hope you'll visit again soon to learn more about our exciting technology solutions. Until next time, remember that Xhenvolt Uganda is here to transform your business dreams into digital reality! 🚀",
  
  "what is xhenvolt": "Xhenvolt Uganda is a leading technology solutions provider founded in June 2025. We specialize in custom software development, mobile applications, POS systems, and enterprise solutions that transform businesses across East Africa. Our mission is to empower African businesses with cutting-edge technology that drives growth and innovation.",
  
  "what is drais": "DRAIS is our comprehensive School Management System that revolutionizes educational institution operations. It includes student enrollment, grade management, parent-teacher communication portals, fee management, attendance tracking, and academic performance reporting. Successfully implemented at schools like Northgate School, DRAIS has helped reduce administrative workload by 60% while improving parent-teacher communication.",
  
  "what is zyra": "Zyra is our powerful SACCO Management System designed for financial cooperatives like Bumwena Scrap SACCO. It automates member management, loan processing, savings tracking, interest calculations, and compliance reporting. Our happiest client, Wekesa Muhammad, leads a 500+ member cooperative that has been completely transformed by Zyra, achieving 100% member satisfaction.",
  
  "what is sentra": "Sentra is our intelligent Point-of-Sale (POS) system for retail businesses. It features real-time inventory tracking, multi-location management, sales analytics, customer loyalty programs, and offline mode capability for uninterrupted operations. Sentra helps businesses streamline their retail operations and increase profitability.",
  
  "what is lypha": "Lypha is our modern Pharmacy Management System that streamlines prescription tracking, inventory management, customer records, and regulatory compliance for pharmaceutical businesses. It helps pharmacies operate more efficiently while maintaining strict compliance standards.",
  
  "services": "We offer comprehensive technology solutions including: Custom Software Development, Mobile App Development (iOS & Android), UI/UX Design, POS & Inventory Systems, School Management Systems (DRAIS), SACCO Management (Zyra), Healthcare Solutions, Process Automation. All solutions are tailored to your specific business needs.",
  
  "pricing": "We offer flexible pricing models to suit different budgets: fixed-price projects, hourly rates, and monthly retainers. Pricing depends on project complexity, timeline, and features. We also provide milestone-based payment plans for larger projects and comprehensive maintenance packages. Contact us at +256 741 341 483 for a personalized quote!",
  
  "contact": "You can reach us at +256 741 341 483, email info@xhenvolt.com, or visit our office in Bulubandi, Iganga, Uganda. We're available Monday-Friday, 8:00 AM - 6:00 PM EAT. We also offer free consultations to discuss your project requirements!",
  
  "team": "Our expert team includes Hamuza Ibrahim (Founder & CEO), Mubeezi Calebu Ashiraf (Lead UI/UX Designer), Nasa Matovu (Lead Full-Stack Developer), and Ganiyu Kule Hussein (Marketing & Growth Lead). Each brings specialized expertise in technology and business strategy to deliver exceptional results.",
  
  "wekesa muhammad": "Wekesa Muhammad is the Chairperson of Bumwena Scrap SACCO, our happiest client with 100% satisfaction! He leads a 500+ member cooperative that has been completely transformed by our Zyra SACCO Management System. The system automated their loan processing, member management, and financial reporting, making Wekesa our biggest success story!",
  
  "success stories": "Our clients have achieved remarkable results: 60% reduction in administrative workload at schools, 45% increase in staff productivity at hospitals, 40% improvement in student completion rates at memorization centers, and 100% client satisfaction across all 25+ projects. We've transformed organizations across education, healthcare, finance, and more!",
  
  "why choose xhenvolt": "Choose Xhenvolt for our rapid delivery (25+ successful projects in just 3 months), 100% client satisfaction, expert team, enterprise-grade security, deep African market understanding, flexible pricing, comprehensive support, and proven track record across multiple industries. We're not just developers - we're your technology transformation partners!",
  
  "mission": "Our mission is to empower African businesses and institutions with cutting-edge technology solutions that drive sustainable growth, improve efficiency, and create lasting positive impact in communities across the continent.",
  
  "vision": "To become the leading technology partner for organizations across Africa, driving digital transformation that bridges the gap between traditional operations and modern innovation, creating a more connected and prosperous continent.",
  
  "demo": "Yes! We offer product demonstrations for all our solutions. Contact us to schedule a demo of DRAIS School Management, Zyra SACCO System, Sentra POS, Lypha Pharmacy System, or any of our custom solutions. Call +256 741 341 483 to book your demo today!",
  
  "consultation": "We offer free consultations to discuss your project requirements. Contact us at +256 741 341 483 or info@xhenvolt.com to schedule a consultation. We'll analyze your needs and provide customized solution recommendations with no obligation."
}
